#+TITLE: Async/Await
#+AUTHOR: DiegoAGtz
#+DATE: <2022-02-18 vie.>

* Async / Await
La declaración async define una función asíncrona.
Cuando se llama una función async, esta devuelve un elemento Promise. Cuando la función async devuelve un valor, Promise se resolverá con el valor devuelto.
Si la función async genera una excepción o algún valor, Promise se rechazará con el valor generado.

Una función async puede contener una expresión await, la cual pausa la ejecución de la función asíncrona y espera la resolución de la Promise pasada y, a continuación, reanuda la ejecución de la función async y devuelve el valor resuelto.

#+begin_src js
function mensaje() {
    return new Promise((resolve, reject) => {
        setTimeout(() => {
            if (true) {
                resolve('Esto se ejecuta después de 1 segundo');
            } else {
                reject('Hubo un error')
            }
        },1000);
    });
}

async function llamadaAsync() {
    console.log('Llamada...');
    const res = await mensaje();
    return res;
}

llamadaAsync()
    .then(msj => console.log(msj))
    .catch(error => console.log(error));
#+end_src

#+RESULTS:
: Llamada...
: undefinedEsto se ejecuta después de 1 segundo
